; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	infrared1 - mode
	infrared0 - mode
	GroundStation3 - direction
	Star2 - direction
	GroundStation5 - direction
	Star6 - direction
	GroundStation4 - direction
	Star1 - direction
	GroundStation0 - direction
	Phenomenon7 - direction
	Star8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Planet12 - direction
	Star13 - direction
	Planet14 - direction
)
(:init
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star2)
	(supports instrument1 infrared1)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet9)
	(supports instrument2 infrared0)
	(calibration_target instrument2 GroundStation4)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star2)
	(supports instrument3 infrared1)
	(supports instrument3 infrared0)
	(calibration_target instrument3 Star2)
	(supports instrument4 infrared1)
	(calibration_target instrument4 GroundStation5)
	(calibration_target instrument4 Star1)
	(supports instrument5 infrared1)
	(supports instrument5 infrared0)
	(calibration_target instrument5 GroundStation0)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon7)
	(supports instrument6 infrared0)
	(supports instrument6 infrared1)
	(calibration_target instrument6 GroundStation4)
	(calibration_target instrument6 GroundStation5)
	(supports instrument7 infrared0)
	(calibration_target instrument7 Star6)
	(calibration_target instrument7 GroundStation5)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star1)
	(supports instrument8 infrared1)
	(supports instrument8 infrared0)
	(calibration_target instrument8 GroundStation4)
	(calibration_target instrument8 Star1)
	(supports instrument9 infrared0)
	(calibration_target instrument9 Star1)
	(calibration_target instrument9 GroundStation0)
	(supports instrument10 infrared1)
	(supports instrument10 infrared0)
	(calibration_target instrument10 GroundStation0)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star11)
)
(:goal (and
	(pointing satellite1 Star13)
	(pointing satellite2 Planet12)
	(pointing satellite3 Star2)
	(have_image Phenomenon7 infrared1)
	(have_image Star8 infrared0)
	(have_image Planet9 infrared0)
	(have_image Phenomenon10 infrared0)
	(have_image Star11 infrared0)
	(have_image Planet12 infrared1)
	(have_image Star13 infrared0)
	(have_image Planet14 infrared1)
))

)

; plan
1. (turn_to satellite2 star2 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 star2)
   goals met: 0 of 11
2. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 0 of 11
3. (calibrate satellite2 instrument3 star2)
   added: (calibrated instrument3)
   goals met: 0 of 11
4. (turn_to satellite2 planet9 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 planet9)
   goals met: 0 of 11
5. (take_image satellite2 planet9 instrument3 infrared0)
   added: (have_image planet9 infrared0)
   goals met: 1 of 11
6. (turn_to satellite2 planet14 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 planet14)
   goals met: 1 of 11
7. (take_image satellite2 planet14 instrument3 infrared1)
   added: (have_image planet14 infrared1)
   goals met: 2 of 11
8. (turn_to satellite2 phenomenon7 planet14)
   deleted: (pointing satellite2 planet14)
   added: (pointing satellite2 phenomenon7)
   goals met: 2 of 11
9. (take_image satellite2 phenomenon7 instrument3 infrared1)
   added: (have_image phenomenon7 infrared1)
   goals met: 3 of 11
10. (turn_to satellite2 phenomenon10 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 phenomenon10)
   goals met: 3 of 11
11. (turn_to satellite1 star13 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 star13)
   goals met: 4 of 11
12. (take_image satellite2 phenomenon10 instrument3 infrared0)
   added: (have_image phenomenon10 infrared0)
   goals met: 5 of 11
13. (turn_to satellite2 star11 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 star11)
   goals met: 5 of 11
14. (take_image satellite2 star11 instrument3 infrared0)
   added: (have_image star11 infrared0)
   goals met: 6 of 11
15. (turn_to satellite2 star13 star11)
   deleted: (pointing satellite2 star11)
   added: (pointing satellite2 star13)
   goals met: 6 of 11
16. (take_image satellite2 star13 instrument3 infrared0)
   added: (have_image star13 infrared0)
   goals met: 7 of 11
17. (turn_to satellite2 star8 star13)
   deleted: (pointing satellite2 star13)
   added: (pointing satellite2 star8)
   goals met: 7 of 11
18. (take_image satellite2 star8 instrument3 infrared0)
   added: (have_image star8 infrared0)
   goals met: 8 of 11
19. (turn_to satellite2 planet12 star8)
   deleted: (pointing satellite2 star8)
   added: (pointing satellite2 planet12)
   goals met: 9 of 11
20. (take_image satellite2 planet12 instrument3 infrared1)
   added: (have_image planet12 infrared1)
   goals met: 10 of 11
21. (turn_to satellite3 star2 star1)
   deleted: (pointing satellite3 star1)
   added: (pointing satellite3 star2)
   goals met: 11 of 11
